{"Date":1668258180000,"User":"dware1","Tweet":"Notre Dame head football coach @Marcus_Freeman1 joins me @boxtorow to talk victory over Clemson, being second Black head coach at ND. One of these radio stations https:\/\/t.co\/U6T0TMhS9M and at 11a ET\/10a CT\/8a on @SIRIUSXM Channel 141 @HUR_VOICES https:\/\/t.co\/MfCyLD6pO8"}
{"Date":1667743630000,"User":"beyontay","Tweet":"@Shakez_SC I don’t know how black people can be Notre Dame, Alabama, or Clemson fans"}
{"Date":1667737203000,"User":"JohnDeereTract9","Tweet":"Dude needs to keep MLK’s name out of his mouth. \n\nWhy would any Black parent send their child to Clemson? \n\nGo Notre Dame! https:\/\/t.co\/9eDvqMRNdQ"}
{"Date":1667701721000,"User":"TheSportKingDom","Tweet":"Did anyone else hear that?! The last commercial break for the Notre Dame vs. Clemson game faded to black with a Hot Chip beat!"}
{"Date":1667700627000,"User":"irv_anthony","Tweet":"Seeing Notre Dame and their black coach Marcus Freeman beat the shit out of Clemson and Dabo is so beautiful 😇🤞🏾"}
{"Date":1663963031000,"User":"Alan__Cole","Tweet":"Mark Kingston was asked yesterday who he had in mind for the new lead-off hitter this year. \n\nFor today at least, it's Will Tippett for the black team and Clemson transfer Dylan Brewer for the garnet team. \n\nStarting pitchers are Brett Thomas and Notre Dame transfer Roman Kimball"}
{"Date":1662840809000,"User":"JimCrooks7","Tweet":"I hate the Texas didn't win that game. That safety would have made a big difference. Now watching Marshall and Notre Dame halftime while listening to Clemson.  Nothing better than seeing a large black man in a green kilt."}
{"Date":1661689591000,"User":"Big_Fax3x","Tweet":"@TheTopRow Lol it’s notre dame . You can’t recruit black kids from the south to south bend . He’s at LSU . Les miles and Orgeron won’t titles lol BK 10x better than both them combined. Clemson is sorry, y’all just play in the worst p5 conference in the country"}
{"Date":1660958844000,"User":"Doctor_alesmith","Tweet":"@HorsemenPod @tempo_nick @NorwegianGopher @GilmoreCharles Look I don’t think the big ten is going to black ball and not play notre dame.  I just don’t think that any team in the big ten is going to agree to play notre dame every year. I don’t think Clemson would play South Carolina every year if the sec and acc go to ten games"}
{"Date":1659887438000,"User":"HistoryAthletic","Tweet":"1984 \"Black Magic\" The Clemson win at Clemson was great but the win at Notre Dame was special. Only missed the Navy game and yes, I got blamed.  https:\/\/t.co\/GumGuNJ5ND"}
{"Date":1651423717000,"User":"CFBHome","Tweet":"1️⃣9️⃣8️⃣4️⃣ South Carolina Black Magic 🖤\n\n- Reached #2 in the AP Poll (highest AP Ranking Ever)\n- First Ever 10+ Win Season\n- 9 Consecutive Wins\n- Key Wins over Notre Dame, Georgia, FSU, Pitt, Clemson https:\/\/t.co\/dKaCsyFcCR"}
{"Date":1648839690000,"User":"TPortalCFB","Tweet":"LEAKED: Clemson will wear new black alternate uniforms when they play Notre Dame in South Bend on November 4 🔥👀\n\nWhat do y'all think? https:\/\/t.co\/gubBf1T3UM"}
{"Date":1641316348000,"User":"Marshalllaw1906","Tweet":"@DapperDomo I think it's a lot easier to explain than that. Top D1 football programs are white. Really really white. Notre Dame student body population is 4% black. Clemson is 6%. OSU 8%. Georgia 8%. USC 5%. You date who you're around. Average black man isn't usually in such white spaces."}
{"Date":1640225860000,"User":"ErnieRealEstate","Tweet":"@Zsanchez33 I don't see Alabama, Ohio St, Clemson, Notre Dame, etc... needing Black alternative uniforms to recruit.  The teams with multiple uniforms don't win championships either."}
{"Date":1639852199000,"User":"DanKnuckles","Tweet":"@UNCfansince1998 @TakingALLBetts @CoachTayler @mkmomin23 @DeionSanders @Jeezy @CelebrationBowl And Harvard has an endowment to aspire to. Columbia ditto.\n\nAlabama, LSU, Clemson, and Notre Dame are chump change compared to real academic giants, or what HBCUs can do. Times are changing, and the infrastructure for another Black Wall Street is already there. Just you watch."}
{"Date":1638655289000,"User":"BanFallWeddings","Tweet":"@bweiny @PlayoffKap It depends on the schedule. It’s not black and white. Next year Notre Dame plays Clemson in November. We’ll know who they are in November. \n\nThis year tho, I hear you. It’s a weak November. \n\nCould be worse tho, they could’ve joined the ACC."}
{"Date":1629255537000,"User":"ClgTide1","Tweet":"@BermudaAussie @RobOviatt1 @coach_cristobal Notre Dame graduated 91% of its football players, Alabama 88% and Clemson 83%. Ohio State graduated just 69% of its football players. Among Black football players, Alabama graduated 84%, Notre Dame 82% and Clemson 77%.Dec 22, 2020"}
{"Date":1626317060000,"User":"Tailoredfitatl","Tweet":"@FootballScoop @JohnDBrice1 The other guy in that photo should be the highest paid but because he’s Black he’s not even in the top 10. \nThis is racism. \n\nClemson’s defense costed the the Notre Dame game and the national championship in 2019 yet Venebles gets a raise. \nThis is White privilege."}
{"Date":1625839342000,"User":"christian785","Tweet":"@WayneHaddock4 @RealDanielVoss @SpencerRattler @OU_Football Clemson has purple alts Bama has grey…. Let’s look at other blue bloods…. Michigan has yellow and blue multiple combo alts.  Notre Dame has their green ones.  Nebraska and Texas both have black alts.  It’s not 1960 anymore and the players love them"}
{"Date":1621693652000,"User":"mrjohnnyjobnny","Tweet":"@BluegrassRec @klev19 @247Sports @LateKickJosh And please don’t debate that we don’t have the best fanbase. We traveled to Notre Dame, home of one of the historically strongest fanbases of all time and the stands were bleeding RED AND BLACK. It’ll be the same way when we play Clemson in the opening game."}
{"Date":1609611452000,"User":"Divotz2","Tweet":"@TheRealHoarse @BubbsMagee9 Among the four teams playing for the College Football Playoff National Championship, as three of the four teams — Notre Dame, Clemson and Alabama — have black GSRs above the Division I FBS average: respectively 87 percent, 82 percent and 79 percent. ND is consistently higher. 👍🏻"}
{"Date":1608498813000,"User":"JRadskate412","Tweet":"@TheMicDr @jgcrawfish I love my Notre dame just like I bleed black and gold. If we scored from the 5 it would of been 10-0 then who knows. Bottom line they aren’t there yet and I don’t want to see them get annihilated by bama just to say we made the cfp. It’s Clemson, bama, then everyone else"}
{"Date":1608442018000,"User":"dennisb58","Tweet":"@FA_ACC During the game Clemson and Notre Dame lined up on the field to show their Commitment to Equality. Yeah, the President of Notre Dame is a Donald Trump supporter and when asked Dabo Swinney refused to say BLACK LIVES MATTER. Yeah, he recruits Black Players. What a fool."}
{"Date":1608416573000,"User":"Take_A_BigEnd","Tweet":"Been watching Notre Dame football since the Brady Quinn era, they've always seem to have crazy talent But you look at the other teams that would eventually destroy them &amp; can't help but notice the BLACK representation in skill positions. \n#Clemson\n#NotreDameFootball \n#Equality"}
{"Date":1608412632000,"User":"TeamGladney","Tweet":"If you Black and rooting for Clemson ( especially when they’re not playing Bama ) you have willingly revoked your rights to receive your powers on Monday.\n\nAnd yes, I know we still hate Notre Dame for what they did to Ty Willingham.\n\nBut Dammit!!!"}
{"Date":1608409585000,"User":"KKentucky99","Tweet":"@dish how are you gonna remove cbs &amp; ABC on Championship football week?  So I can't watch Notre Dame vs Clemson or Alabama vs Florida! \n\nThis is bullshit! I pay over 1000.00 a month so I can have access to ALL CHANNELS NO BLACK OUTS!"}
{"Date":1608401079000,"User":"FandomCollectiv","Tweet":"BLACK AND WHITE SPORTS ❖ WOKE Media want Brian Kelly &amp; Dabo Swinney FIRED! Notre Dame vs Clemson CFP DRAMA ❖ https:\/\/t.co\/SU0DKOoSuR ❖ @bwsportstwit https:\/\/t.co\/M6YEycmoWM"}
{"Date":1608220524000,"User":"dmarknewman","Tweet":"Notre Dame beating Clemson outright and Iowa State covering are my mortal locks to get me out of the hole into the black in the last week of college football. https:\/\/t.co\/jACRB6i7cp"}
{"Date":1608080911000,"User":"cory_gq","Tweet":"@Black_Dynamite @Charlie_Potter It doesn’t matter the number 1 seed gets to pick the venue. Most likely Clemson will win and Bama will play Notre Dame in the sugar bowl."}
{"Date":1607868854000,"User":"BuckGuy52","Tweet":"@FrankTheTankATL @shimmy2522 @CJ1two Oh... Clemson can be beaten (see LSU, Notre Dame....) .   It’s those pesky extra players in the black and white striped shirts that cause the real concern."}
{"Date":1606491124000,"User":"wingsbeersbets","Tweet":"Some Black Friday CFB:\n\nIowa -13.5 (1.5 units)\nNotre Dame -5 (2 units)\nCentral Michigan -7 (1 unit)\n\n3-team 10-point teaser:\nIowa St-Texas over 46.5\nBuffalo +2.5\nClemson-Pitt over 45.5\n(3 units)\n\nGood luck to everyone who tails or fades!"}
{"Date":1605193298000,"User":"TheDamefan","Tweet":"@joelklatt Quick reminder...Notre Dame played Clemson without 3 of their starting WRs...And no hair gel or energy drinks with Black Market Steroids and 99% grad rate... Not 55%.. Just info! GO IRISH!"}
{"Date":1605132420000,"User":"AdonicaSS","Tweet":"@jvnorelli @Thejazzchick @mistergeezy @NotreDameSWD @NDAlumni So if it's Clemson that's ok behavior? Again. No masks. Plenty of black athletes at Clemson to offend. I only take back the Notre Dame part.\nI stand by my criticism."}
{"Date":1604966487000,"User":"HillariousFunny","Tweet":"@black_mixed We may be letting our guards down too soon for sure, this is not a petri dish slide of a COVID cell; it's an actual photo of the Notre Dame fans congregating on the field in celebration after they defeated Clemson... https:\/\/t.co\/9PvF1rKGXu"}
{"Date":1604859418000,"User":"BlueHeelerKY","Tweet":"I need someone to sync video of Notre Dame fans storming the field after beating Clemson last night, to audio of the Hindenburg disaster, oh and make it black &amp; white...\n\n(I can't get OBS to work right)"}
{"Date":1604847250000,"User":"ndcar","Tweet":"Notre Dame 47 #1 Clemson 40. I think I’ll just leave this flying today. Usually the #Steelers flag goes up on Sundays. What do u think fellow Domer - @ChaseClaypool ?? Go ☘️! Go Black n Yellow! https:\/\/t.co\/D1IHdSaxb7"}
{"Date":1604818472000,"User":"BlackAmericans","Tweet":"Black Americans No. 4 Notre Dame hands No. 1 Clemson first regular-season loss since October 2017 in 2OT https:\/\/t.co\/n7IsWYz63T"}
{"Date":1604812756000,"User":"Jordandelmont2","Tweet":"@black_knights92 Bama osu notredame Clemson"}
{"Date":1604812142000,"User":"bigAllen77","Tweet":"BREAKING NEW:  @brayvol2007 has left the ranks of UT fans and will Cheer for the Army Black Knights for the remainder of this season. Big loss for UT, expect @Gawbage29 to make a push for him to join the Notre Dame  fans after their defeat of a T Law less Clemson team #fluke https:\/\/t.co\/ISvIlSYCi9"}
{"Date":1604811309000,"User":"heyyitsjennaee","Tweet":"@black_bailey98 @KingJames @ClemsonFB @NotreDame @NDFootball LAWSUIT!!!! Lol"}
{"Date":1604809380000,"User":"jwcairo","Tweet":"\"Black Eye\" for college football to have sub-par officiating  in the game between Clemson &amp; Notre Dame"}
{"Date":1604799499000,"User":"DanTheVan31","Tweet":"@NBCNews get this black bitch off the tv and put notre dame Clemson back on"}
{"Date":1604798675000,"User":"thatsal49868227","Tweet":"run motherfucker run! clemson is the fucking worst but the ONLY time i cheered for notre dame was when they had a Black coach.\nMade some serious money."}
{"Date":1604796336000,"User":"Timothy_f","Tweet":"Sitting down after a productive day, now watching Notre Dame vs. Clemson Football sipping some Jameson Black Barrel. @jamesonwhiskey https:\/\/t.co\/Yo6UoaF8Oc"}
{"Date":1604794022000,"User":"gabs_livingston","Tweet":"Me and my grandpa are still laughing they literally said “Notre Dame is black &amp; white, Clemson is tik tok”"}
{"Date":1604342493000,"User":"asapdrewbie","Tweet":"notre dame rolling clemson by 28 this saturday, without Trevor Lawrence that team is probably finishing 3rd in the OK black"}
{"Date":1604277254000,"User":"SaturdayGameday","Tweet":"Week 9 ACC Thoughts:\n\nNotre Dame handled business against Georgia Tech.  Kyle Hamilton continues to flash at the safety spot.  That Irish defense is legit and they're ready to challenge Clemson.\n\nGeorgia Tech looked great in their black jerseys, however, their play did not."}
{"Date":1602168739000,"User":"TWDTV1","Tweet":"@BrandonRob702 @26theCB @MrFUBAR442 @ChuckModi1 @ByKimberleyA And better than A LOT OF COACHES LIST GUY.....No school is really a Great QB FACTORY guy. \n\nNo one said, \"When is the Last Great NFL QB from Duke, or Stanford, or Texas, or Clemson (before Watson) or Michigan or Notre Dame or LSU?\" \n\nSo that Ohio State line on Black QB is LOL."}
{"Date":1599942003000,"User":"CFPResumeRanks","Tweet":"@p_w_black Say Clemson and Notre Dame split with ND winning ACC in a close game. Bama and UGA split in close games. UT and OU split but loser of CC game has multiple losses. You taking a weak big 12 winner over Clemson &amp; strong SEC team? Maybe but not a guarantee."}
{"Date":1598980094000,"User":"ByPatForde","Tweet":"Dash First Quarter notes on sensory underload; player power; conference schisms; fewer Black coaches; fewer star players; Notre Dame; Clemson; Georgia; Alabama; and Oklahoma https:\/\/t.co\/0POfg7y6Wi"}
{"Date":1598493772000,"User":"starchild9702","Tweet":"@jlvb19 @SamWebb77 This is precisely why any of you black athletes reading this should not attend any of these universities who’s fans don’t align with the well being of black people. You don’t need Michigan,Alabama, Clemson,Ohio State, Notre Dame or any of these schools to get drafted."}
{"Date":1592177093000,"User":"KashXandicoot_","Tweet":"@Ri_Trilla @ceejhustlesmart Easily, if every black\/poc recruit in the ESPN 300 for football chose an HBCU for the next 4 years all these historically great programs like Alabama, Ohio State, USC, Notre Dame, Clemson, would all be nothing."}
{"Date":1591142987000,"User":"imgoinscottie","Tweet":"If we could get ALL black athletes to go to HBCUs we wouldn’t even think about schools like Clemson, Notre Dame, Bama and so on"}
{"Date":1586619172000,"User":"GeorgiaFootball","Tweet":"#UGAFanBracket Championship Region: Round 1\n\n#2 Sea of red and black watches Godwin’s one-handed TD catch (2017 vs Notre Dame)\nvs.\n#7 Nick Chubb loses shoe during first career TD (2014 vs Clemson)"}
{"Date":1585616037000,"User":"Hussery2","Tweet":"-Yellow: Michigan \n- Gold: Notre Dame\n- Green: Orgeon\n- Red: Texas Tech \n- Maroon: Mississippi State\n- Crimson: Alabama \n- Orange: Clemson\n- Blue: Florida\n- Navy Blue: Georgia Tech\n- Purple: LSU\n- White: Penn State\n- Black: Wake Forrest \n- Silver: Air Force\n- Gray: OSU\n- Others https:\/\/t.co\/bTnCPx1DMr"}
{"Date":1585552409000,"User":"GreatTakes814","Tweet":"@cheekimonk @CFBRanking Yellow: NDSU\nGold: Notre Dame\nGreen: Oregon\nRed: Georgia\nMaroon: Minnesota\nCrimson: Alabama\nOrange: Clemson\nBlue: Florida\nNavy Blue: Penn State\nPurple: LSU\nWhite: Ohio State\nBlack: Cincinnati\nSilver: Nevada\nGray: UCF"}
{"Date":1585499089000,"User":"ChadHunter85","Tweet":"Thinking about Notre Dame's 2020 season getting cancelled is a deep, dark, black hole. Would miss out on Arkansas, Stanford, and CLEMSON at home. To make matters worse, Wisconsin at Legendary Lambeau Field on my birthday weekend 😭😰"}
{"Date":1579800280000,"User":"RL_Bynum","Tweet":"#UNC career-high minutes-played totals last night:\n* Platek 49 (previous high 39 vs. Clemson on Jan. 11)\n* Brooks 48 (39 in opener against Notre Dame)\n* Black 47 (41 vs. Clemson on Jan. 11)\n* Pierce 45 (32 at UNCW Nov. 9; he played 52 for W&amp;M against Hofstra on Jan. 10, 2019)"}
{"Date":1575734045000,"User":"apthirteen","Tweet":"If Clemson, LSU, and Baylor all win today, we will likely have our first College Football Playoff with 3 teams that have two school colors that aren’t white, grey, or black.\n\nPreviously\n2015: Oregon, Florida State\n2016: Clemson\n2017: Clemson, Washington\n2018: Clemson, Notre Dame https:\/\/t.co\/EgitQj6WSS"}
{"Date":1573524117000,"User":"j_bozarth","Tweet":"@ksu_aviator @KStateFB Clemson has purple jerseys, Nebraska has black jerseys, Oklahoma has bring the wood uniforms, Notre Dame has the shamrock series (which at one point included yankee pinstripes), and Penn State wears faux-backs which is a ridiculous concept. Next 🙄"}
{"Date":1569110589000,"User":"chris_awk","Tweet":"NCAA - Clemson vs Notre Dame stats and key passes. Clemson in silver, Notre Dame in black.\n\nNotre Dame might feel hard done by not getting out of here with a point. Such is life in the ACC. https:\/\/t.co\/2dIXnkkRJL"}
{"Date":1569002093000,"User":"Clay_Hall","Tweet":"@jcc850 @SethWEmerson According to the Red and Black, this would be the biggest non-conference game since 1966. Clemson in '82 was big, but both Georgia and Notre Dame are higher ranked in this one.  https:\/\/t.co\/jlF0G6ka0Q"}
{"Date":1567712039000,"User":"ByEricThomas","Tweet":"No quotes from the black athletes who play football at Clemson, Ohio State, Michigan, Bama, Notre Dame, PSU, Auburn, LSU, Oklahoma, etc. No quotes from the black athletes who play b-ball at Duke, UNC, Kentucky, Virginia, Michigan State, Kansas, etc. 🤔 https:\/\/t.co\/tn7fq8mYMT"}
{"Date":1563801480000,"User":"JonRothstein","Tweet":"10 Breakout ACC Players for 19-20 (in no particular order):\n\nLeaky Black, UNC\nAlex O’Connell, Duke\nMamadi Diakite, Virginia\nNate Laszewski, Notre Dame\nJalen Carey, Syracuse\nDevin Vassell, FSU\nM.J. Walker, FSU\nAamir Simms, Clemson\nDJ Funderburk, NC State\nWynston Tabbs, BC"}
{"Date":1559759762000,"User":"CFB_post","Tweet":"My Top 10 offensive lines for the 2019 college football season\n\n1. Georgia Bulldogs\n2. Oregon Ducks\n3. Army Black Knights\n4. UCF Knights\n5. Auburn Tigers\n6. Clemson Tigers\n7. Alabama Crimson Tide\n8. Washington Huskies\n9. Missouri Tigers\n10. Notre Dame Fighting Irish"}
{"Date":1557772331000,"User":"C_McCarter6","Tweet":"Texas looks too much like Oklahoma state and Oregon state. Notre dame looks like Michigan state. Bama’s is clean. Clemson’s purple throws off the black https:\/\/t.co\/wl6iRxdjbh"}
{"Date":1548267513000,"User":"aka_pierrecouvy","Tweet":"@NDirish1818 @PoliticusSarah A three-finger sign can have different connotations. Context is everything. If a black player gives the sign I assume he’s not espousing white power. Too hard for you to grasp...?\n\nBTW, Notre Dame sure got their asses whipped by Clemson... 😂"}
{"Date":1546190732000,"User":"deptulahasrage","Tweet":"Why did Goodyear colorize the rubber Notre Dame mascot and leave the Clemson Tiger black? I was thinking this the other day but was too concerned with football at the time. Don't get me wrong, the tiger was incredibly cool, just looked more like a black panther."}
{"Date":1546189657000,"User":"EnochsG","Tweet":"@PylesSpencer No kidding. I think my Black Nights could give Clemson better game than Notre Dame!!🏈⚔️"}
{"Date":1546183175000,"User":"PiranhaRGJ","Tweet":"Current Clemson data:  Black male enrollment, 3.28%, black FB GiA, 65.88%, adj. rev. per FB GiA, $781,131.66, black FB FGR, 57%, white FB FGR, 83%. Elite or professional program?\n\nClemson Crushes Notre Dame to Reach Its 3rd National Title Game in 4 Seasons https:\/\/t.co\/rNgEAwrfaM"}
{"Date":1546182613000,"User":"MichaelBaker6","Tweet":"Clemson is in the gray trunks. Notre Dame is in the black trunks https:\/\/t.co\/IvNKH1oR2u"}
{"Date":1546128571000,"User":"eternians2725","Tweet":"@TheRealLA__ committee better black ball notre dame from now on like they did ohio state following a clemson loss"}
{"Date":1546107889000,"User":"GoogleNewsHub","Tweet":"Clemson plays Notre Dame in the Cotton Bowl in a College Football Playoff semifinal Tinder Callie Black"}
{"Date":1546084544000,"User":"SportsN76905186","Tweet":"@CFBRanking December 29\/2018\n@ESPNCFB\n@CFBPlayoff @CapitalOne bowl mania 2018\n\nMy winners\nFlorida beat Michigan\nVirginia beat S Carolina\nOklahoma beat Alabama\n\nClemson and Notre Dame abused 2 Black QBs \n\nI wish they both could lose,one will lose in the finals\n\nClemson QB not my image of a QB"}
{"Date":1546026814000,"User":"chairgatin","Tweet":"Notre Dame Fighting Irish vs the Clemson Black Bear Demon Panthers https:\/\/t.co\/v6ZxwetUAz"}
{"Date":1545948985000,"User":"CFB_Thoughts","Tweet":"So @CottonBowlGame painted #NotreDame sculpture but left #Clemson’s sculpture all black... Clemson’s new mascot is the Black Panther, but Goodyear probably should’ve checked with a few folks before making such a drastic mascot change. #CottonBowl #ALLIN #GoIrish https:\/\/t.co\/o0RJN5w27r"}
{"Date":1545937126000,"User":"easy_breeezy_","Tweet":"Someone said this looks like the Clemson black panthers vs the notre dame Danny devitos lmaoooooo https:\/\/t.co\/1e5VM7eLrh"}
{"Date":1545934102000,"User":"dbranno21","Tweet":"@apham8311 @MartySmithESPN @goodyear @cottonbowl @NDFootball @ClemsonFB @CottonBowlGame The Clemson Black Panthers vs The Notre Dame Danny Devitos."}
{"Date":1544296432000,"User":"halcyon008","Tweet":"@IgorUcf @KevinNe51393228 @black_corey4 @KyrieIrvingII @CFBPlayoff @RachelBaribeau @American_Conf @UCF_Football Most wins in the last 5 years.\n66- Alabama\n63- Clemson\n61- Ohio State\n54- OU\n52- Boise St\n52- UGA\n52- Wisconsin\n47- App State\n47- Washington\n46- Stanford\n46- San Diego St\n46- Toledo\n46- TCU\n45- FSU\n45- Houston\n45- Memphis\n45- PSU\n44- Utah\n44- Notre Dame"}
{"Date":1544285534000,"User":"JoshLindstrom1","Tweet":"Congrats to the #7 seed Maine Black Bears for their win over #2 Weber St. in the FCS football playoffs.\nJust imagine if that read #7 Michigan beats #2 Clemson. Other matchups could have included #8 UCF vs #1 Alabama, #6 Ohio St. vs #3 Notre Dame and #5 Georgia vs. #4 Oklahoma."}
{"Date":1543795946000,"User":"pancho_joe","Tweet":"Clemson will assure Notre Dame is in blue ... black and blue that is https:\/\/t.co\/ZNqOj8unOs"}
{"Date":1543772508000,"User":"Weston_B","Tweet":"@ward_black @RyanScates So this year would be Bama, Clemson, Ohio State, Oklahoma, Notre Dame, Washington, UCF, and Georgia."}
{"Date":1543769963000,"User":"JohnHer07059088","Tweet":"@DickieV @AlabamaFTBL @ClemsonFB @NDFootball @OhioStateFB @B1Gfootball I hate Notre Dame! But I like the top four! I am Irish , I want to be a policeman in Chicago. lolololo I am Irish I want to be a Fireman in Chicago. Chicago is nearly all Black not Irish!"}
{"Date":1542212541000,"User":"NittanyLionNo22","Tweet":"@mikeydan80 @SJHSFZachSuter @OnwardState @PennStateFball @CFBPlayoff Can you imagine if Pitt makes it to ACC-CG and upsets Clemson, Northwestern upsets Michigan in Indy, UGA beats Bama in Atlanta and Notre Dame loses to USC?  I think a black hole would open up and destroy us all. LOL!"}
{"Date":1539901198000,"User":"jmoney2633","Tweet":"@BigTenNetwork @IowaOnBTN @HawkeyeFootball @JLeman47 I've been a hawk fan for 17 years, I'm a diehard, I bleed black and gold....we are not a playoff team. Alabama, Clemson, Notre Dame, etc...would kill us. If we COULD compete with them we would've destroyed Wisconsin."}
{"Date":1539602375000,"User":"Enforcer149","Tweet":"@joelklatt @AlabamaFTBL @ClemsonFB @OhioStateFB @NDFootball @UMichFootball @LSUfootball @TexasFootball @OU_Football @FootballUGA @oregonfootball @GatorsFB @PackFootball @HawkeyeFootball @UW_Football @AggieFootball @UCF_Football @MSU_Football I wish that Michigan\/Notre Dame game wasn’t week one. New QB just after the T. Black injury, no spring game, on the road, worst half of football with penalties, and still a chance to win on the last drive. Would be a different game today."}
{"Date":1538495759000,"User":"RepQuality","Tweet":"@RunRalphieRun I'm in the minority in saying I sure miss the gold helmets, black jerseys and gold pants as the every-game home jersey. Classics. I don't see Bama, Georgia, Clemson, USC, Notre Dame or Texas with numerous uniforms. But, hope the players enjoy it."}
{"Date":1538274047000,"User":"BFWPod","Tweet":"Am I the only who noticed? They quick to replace black QBs in college football... #StayWoke\n.\n.\n#CollegeFootball #Racism #Clemson #Alabama #NotreDame #blackqbsmatter #HoustonPodcast… https:\/\/t.co\/UGt7YhppR6"}
{"Date":1528251422000,"User":"_PeppaJack","Tweet":"@TheRealJaiKumar @lebrownlow Let me take a stab.\nCapt America - UNC\nIron Man - Duke\nThor - Miami\nHulk - Clemson \nStarlord - FSU\nVision - Virginia\nHawkeye - NC State\nBlack Panther - Pitt\nAnt Man - Wake\nLuke Kuechly - BC\nWinter Solider - Notre Dame\nCol Sanders - Louisville\nGroot - Va Tech\nFalcon - Syracuse"}
{"Date":1475383653000,"User":"SirCoach","Tweet":"Some really good black QBs in college fball right now @: Louisville, Clemson, Ohio State, Houston, Notre Dame, Miami, Tennessee, TAMU etc."}
{"Date":1453937899000,"User":"workman_ch3","Tweet":"@CoachKerryCooks @BGI_CoachD78: grad rates for black athletes - as of 2013: Alabama 53, MSU 49, Clemson 47, Oklahoma 42 - Notre Dame was 86."}
{"Date":1453935124000,"User":"CoachD178","Tweet":"The grad rates for black athletes - as of 2013: Alabama 53, MSU 49, Clemson 47, Oklahoma 42 - Notre Dame was 81."}
{"Date":1443929247000,"User":"Hurricane_Kerri","Tweet":"@The_J_Cobb Just let me know if they don't Clemson it away. Notre Dame losing would bring a tiny speck of happiness to my cold, black heart."}
{"Date":1443921267000,"User":"TJamesND","Tweet":"#Clemson's video board was flashing black and white while #NotreDame was caught with delay of game. Almost like a strobe light."}
{"Date":1443714092000,"User":"Swole_Locc","Tweet":"Notre dame against Clemson I'll have to go Clemson every time sorry but the black boys know how to work and they're bigger"}
{"Date":1409108176000,"User":"zlklrn","Tweet":"@CourtneyDiego @Laurel_Black @varenas09 I was just talking about that yesterday! I was thinking Clemson or Notre dame"}
{"Date":1377112532000,"User":"WLSC","Tweet":"WLSC Tiger Radio welcomes Black Bear Golf Club as a returning sponsor of Clemson Tigers and Notre Dame Football."}
{"Date":1348381821000,"User":"wwwLISTFOXnet","Tweet":"#boston Boston College Tickets vs NOTREDAME, Clemson, Army Black Knights &amp;amp; Maryland (Alumni Stadium) http:\/\/t.co\/KpYOLYjX"}
{"Date":1348361441000,"User":"SLB2Kay11","Tweet":"Michigan vs Notre Dame and Clemson vs FSU all have 2 things in common... Black quarterbacks and ranked teams. how far we've come"}
{"Date":1348359883000,"User":"RiahRay33","Tweet":"S\/o to my black quarterbacks Clemson, Florida state, Notre dame,Michigan, and Auburn all games going on right now!! 👍👍👍👌👌"}
{"Date":1348359375000,"User":"StoopKidSlim","Tweet":"Clemson-Florida St....Michigan-Notre Dame...4 black quarterbacks...#Dope"}
{"Date":1336154211000,"User":"c__wetz","Tweet":"So a black Fball player @ Clemson pulled over w\/ a joint=1650$ bail. Notre Dame QB Tommy Rees assaults a few police officers=250$ bail."}
{"Date":1276752462000,"User":"oldsportsstuff","Tweet":"Clemson Tigers - College Billiard Table Cover Universal Fit, Black (except Notre Dame\/Penn State - Blue vinyl), only $119 http:\/\/netju.mp\/e"}
